Repository: mlverse/torchvision
Catalog: po/R-*.po
Languages: fr

source: Invalid collection. Must be one of:
fr: Collection non valide. Doit être l'une des suivantes :

source: No datasets found matching criteria
fr: Aucun ensemble de données ne correspond aux critères.

source: Dataset {.val {self$dataset}} split {.val {self$split}} of {.cls {class(self)[[1]]}} (~{.emph {self$archive_size}}) will be downloaded and processed if not already available.
fr: La partition {.val {self$split}} du jeu de données {.cls {class(self)[[1]]}} (de taille ~{.emph {self$archive_size}}) sera téléchargée et traitée si elle n'est pas déjà disponible.

source: Dataset not found. Use download=TRUE or check that parquet files exist at the expected paths.
fr: Jeu de données introuvable. Veuillez ajouter `download = TRUE` pour le télécharger, ou vérifier que le fichier `.parquet` existe à l'emplacement attendu.

source: {.cls {class(self)[[1]]}} dataset loaded with {self$.length()} images for split {.val {self$split}}.
fr: Le jeu de données {.cls {class(self)[[1]]}} est disponible avec {self$.length()} images pour la partition {.val {self$split}}.

source: Downloading {.val {self$dataset}}...
fr: Téléchargement de {.val {self$dataset}}...

source: Corrupt file! Delete the cached files and try again.
fr: Fichier corrompu. Supprimez le fichier en cache et recommencez.

source: Dataset {.cls {class(self)[[1]]}} (~{.emph {self$archive_size}}) will be downloaded and processed if not already available.
fr: Le jeu de données {.cls {class(self)[[1]]}} (de taille ~{.emph {self$archive_size}}) sera téléchargé et traité s'il n'est pas déjà disponible.

source: Dataset not found. You can use `download = TRUE` to download it.
fr: Jeu de données introuvable. Veuillez ajouter `download = TRUE` pour le télécharger.

source: {.cls {class(self)[[1]]}} dataset loaded with {self$.length()} images across {length(self$classes)} classes.
fr: Le jeu de données {.cls {class(self)[[1]]}} est disponible avec {self$.length()} images réparties en {length(self$classes)} classes.

source: Downloading {.cls {class(self)[[1]]}}...
fr: Téléchargement de {.cls {class(self)[[1]]}}...

source: Corrupt file! Delete the file in {archive} and try again.
fr: Fichier corrompu. Supprimez le fichier {archive} et recommencez.

source: Dataset {.cls {class(self)[[1]]}} downloaded and extracted successfully.
fr: Le jeu de données {.cls {class(self)[[1]]}} a été téléchargé et extrait avec succès.

source: Dataset {.cls {class(self)[[1]]}} (~{.emph {self$archive_size}}) will be downloaded and processed if not already cached.
fr: Le jeu de données {.cls {class(self)[[1]]}} de taille (~{.emph {self$archive_size}}) sera téléchargé et traité s'il n'est pas déjà disponible.

source: Files not found. Use download = TRUE
fr: Fichier introuvable. Veuillez utiliser `download = TRUE`

source: Dataset {.cls {class(self)[[1]]}} loaded with {length(self$y)} images across {length(self$classes)} classes.
fr: Le jeu de données {.cls {class(self)[[1]]}} contient {length(self$img_path)} images réparties en {length(self$classes)} classes.

source: Downloading {.cls {class(self)[[1]]}} ...
fr: Téléchargement de {.cls {class(self)[[1]]}}...

source: {.cls {class(self)[[1]]}} dataset loaded with {length(self$image_ids)} images.
fr: Jeu de données {.cls {class(self)[[1]]}} chargé avec {length(self$image_ids)} images.

source: Index out of bounds
fr: Index hors limites.

source: Dataset {.cls {class(self)[[1]]}} loaded with {length(self$data)} images across {length(self$classes)} classes.
fr: Le jeu de données {.cls {class(self)[[1]]}} contient {length(self$data)} images réparties en {length(self$classes)} classes.

source: Extracting {.cls {class(self)[[1]]}} archive...
fr: Extraction de l'archive de {.cls {class(self)[[1]]}}...

source: Extraction of {.cls {class(self)[[1]]}} is complete.
fr: Extraction de l'archive {.cls {class(self)[[1]]}} terminée...

source: Downloading {.cls {class(self)[[1]]}} split file: {self$split_url}
fr: Téléchargement du fichier de partition de {.cls {class(self)[[1]]}} depuis {self$split_url} ...

source: Downloaded split file `{self$split_file}` is empty.
fr: Le fichier téléchargé `{self$split_file}` est vide.

source: Image file `{filename}` not found.
fr: Fichier d'image `{filename}` introuvable.

source: Label `{label}` not found in class_to_idx.
fr: Le label `{label}` ne fait pas partie de `class_to_idx`.

source: Processing {.cls {class(self)[[1]]}} ...
fr: Préparation de {.cls {class(self)[[1]]}} ...

source: Dataset not found. Use `download = TRUE` to download it.
fr: Jeu de données introuvable. Veuillez ajouter `download = TRUE` pour le télécharger.

source: {.cls {class(self)[[1]]}} dataset loaded with {length(self$image_paths)} images across {length(self$classes[[annotation_level]])} classes.
fr: Le jeu de données {.cls {class(self)[[1]]}} a été chargé avec {length(self$image_paths)} images réparties en {length(self$classes[[annotation_level]])} classes.

source: Corrupt file! Delete the file at {archive} and try again.
fr: Fichier corrompu. Supprimez le fichier {archive} et recommencez.

source: The following IDs are missing captions: {paste(missing, collapse=', ')}
fr: Les ID suivants n'ont pas de légende : {paste(missing, collapse=', ')}

source: {.cls {class(self)[[1]]}} dataset loaded with {length(self$images)} images across {length(self$classes)} classes.
fr: Le jeu de données {.cls {class(self)[[1]]}} contient {length(self$data)} images réparties en {length(self$classes)} classes.

source: Split {.val {self$split}} of dataset {.cls {class(self)[[1]]}} loaded with {self$.length()} samples.
fr: La partition {.val {self$split}} du jeu de données {.cls {class(self)[[1]]}} est chargée avec {length(self$img_path)} images.

source: Split {.val {self$split}} of dataset {.cls {class(self)[[1]]}} is already processed and cached.
fr: La partition {.val {self$split}} du jeu de données {.cls {class(self)[[1]]}} a déjà été préparé et mis en cache.

source: {.cls {class(self)[[1]]}} Extracting images and processing dataset...
fr: Extraction d'image et préparation du dataset {.cls {class(self)[[1]]}}...

source: Dataset {.cls {class(self)[[1]]}} loaded with {length(self$targets)} images.
fr: Jeu de données {.cls {class(self)[[1]]}} chargé avec {length(self$targets)} images.

source: Processing {.cls {class(self)[[1]]}}...
fr: Préparation de {.cls {class(self)[[1]]}} ...

source: {.cls {class(self)[[1]]}} (~{.emph {self$archive_size}}) will be downloaded and processed if not already available.
fr: Le jeu de données {.cls {class(self)[[1]]}} (de taille ~{.emph {self$archive_size}}) sera téléchargé et traité s'il n'est pas déjà disponible.

source: Split {.val {self$split}} of dataset {.val {self$dataset}} from {.cls {class(self)[[1]]}} processed successfully!
fr: La partition {.val {self$split}} du jeu de données {.val {self$dataset}} de {.cls {class(self)[[1]]}} a été traitée avec succès !

source: {.cls {class(self)[[1]]}} Split '{self$split}' loaded with {length(self)} samples.
fr: {.cls {class(self)[[1]]}} La partition '{self$split}' est chargée et contient {length(self)} échantillons.

source: Invalid split: {self$split}
fr: Partition non valide : {self$split}

source: Downloading {.cls {class(self)[[1]]}} split '{self$split}'...
fr: Téléchargement du fichier de partition '{self$split}' de {.cls {class(self)[[1]]} ...

source: Split {.val {self$split}} of dataset {.cls {class(self)[[1]]}} (~{.emph {self$archive_size}}) will be downloaded and processed if not already available.
fr: La partition {.val {self$split}} du jeu de données {.cls {class(self)[[1]]}} (de taille ~{.emph {self$archive_size}}) sera téléchargée et traitée si elle n'est pas déjà disponible.

source: has_ops() Not implemented yet. https://github.com/pytorch/vision/blob/b266c2f1a5c10f5caf22f5aea7418acc392a5075/torchvision/extension.py#L60
fr: `has_ops()` n'est aps encore implémenté. https://github.com/pytorch/vision/blob/b266c2f1a5c10f5caf22f5aea7418acc392a5075/torchvision/extension.py#L60

source: Couldn't load custom C++ ops. This can happen if your torch and torchvision versions are incompatible, or if you had errors while compiling torchvision from source. Please reinstall torchvision so that it matches your torch install.
fr: La librairie spécifique C++ ops ne peut être chargée. C'est peut être le symptôme de version de torch et de torchvision incompatibles, ou si vous avez eu des erreurs lors de la compilation de torchvision depuis les sources. Veuillez réinstaller torchvision pour qu'il corresponde à la version de torch.

source: Both extensions and is_valid_file cannot be None or not None at the same time
fr: Vous pouvez configurer `extensions` ou `is_valid_files` mais pas les deux.

source: unknown extension {ext} in path {path}
fr: Extension {ext} inconnue dans le répertoire {path}.

source: Model weights for {.cls {class(model)[1]}} ({.emph {r[3]}}) will be downloaded and processed if not already available.
fr: Les poids du modèle pour {.cls {class(model)[1]}} ({.emph {r[3]}}) seront téléchargés et traités s'ils ne sont pas déjà disponibles.

source: Corrupt file! Delete the file in {state_dict_path} and try again.
fr: Fichier corrompu. Supprimez le fichier {state_dict_path} et recommencez.

source: Unsupported data format
fr: Format de données non-supporté

source: arch must be a single character string.
fr: arch doit être une chaîne de caractères unique.

source: depths and dims must be vectors of length 4.
fr: `depth` et `dim` doivent être des vecteurs de longueur 4.

source: Pretrained model for
fr: Modèle pré-entraîné pour

source: is not available.
fr: n'est pas disponible.

source: {.var num_classes} must be positive
fr: {.var num_classes} doit être positif

source: `pretrained_backbone` ignored when `pretrained = TRUE`.
fr: `pretrained_backbone` est ignoré lorsque `pretrained = TRUE`.

source: Downloading {.cls {arch}} pretrained weights (~{.emph {info[3]}}) ...
fr: Téléchargement des poids pré-entraînés {.cls {arch}} (~{.emph {info[3]}}) ...

source: Model weights for {.cls {arch}} ({.emph {r[3]}}) will be downloaded and processed if not already available.
fr: Les poids du modèle pour {.cls {arch}} ({.emph {r[3]}}) seront téléchargés et traités s'ils ne sont pas déjà disponibles.

source: Pretrained weights require num_classes = 91.
fr: Les poids pré-entraînés nécessitent `num_classes = 91`.

source: Model weights for {.cls {name}} (~{.emph {r[3]}}) will be downloaded and processed if not already available.
fr: Les poids du modèle pour {.cls {name}} (~{.emph {r[3]}}) seront téléchargés et traités s'ils ne sont pas déjà disponibles.

source: Pretrained weights require num_classes = 21.
fr: Les poids pré-entraînés nécessitent `num_classes = 21`.

source: The default weight initialization of inception_v3 will be changed in future releases of
fr: L'initialisation des poids par défaut de inception_v3 sera changé dans les prochaines version de

source: torchvision. If you wish to keep the old behavior (which leads to long initialization times
fr: torchvision. Pour garder les anciens poids (qui allongent temps d'initialisation

source: due to scipy/scipy#11299), please set init_weights={.val TRUE}.
fr: à cause de scipy/scipy#11299) il faut configurer `init_weights={.val TRUE}`.

source: length of {.arg inception_blocks} should be 7 instead of {length(inception_blocks)}
fr: La longueur de {.arg inception_blocks} doit être 7 et non {length(inception_blocks)}.

source: {.var inverted_residual_setting} should be non-empty or a 4-element list, got {.val {inverted_residual_setting}}
fr: {.var inverted_residual_setting} doit être non vide ou une liste de 4 éléments, et non {.val {inverted_residual_setting}}.

source: illegal stride value
fr: valeur illégale pour `stride`

source: basic_block only supports groups=1 and base_width=64
fr: `basic_block` ne fonctionne qu'avec `groups=1` et `base_width=64`.

source: Dilation > 1 not supported in basic_block
fr: Pas de `dilation` > 1 dans le `basic_block`.

source: replace_stride_with_dilation should be NULL
fr: `replace_stride_with_dilation` doit être `NULL`

source: or a 3-element tuple, got {length(replace_stride_with_dilation)}
fr: ou une liste de 3 éléments, et non pas {length(replace_stride_with_dilation)} éléments.

source: Unsupported Bounding Box Conversions for given in_fmt and out_fmt
fr: Le type de conversion demandé pour la boite englobante n'existe pas pour `in_fmt` et `out_fmt`.

source: must be positive if a single number
fr: doit être positif quand c'est une valeur unique

source: out of bounds.
fr: Index hors limites.

source: degrees must be positive if it's a single value
fr: `degrees` doit être positif quand c'est une valeur unique.

source: degrees must be length 1 or 2
fr: `degrees` doit être de longueur 1 ou 2

source: translate must be length 2
fr: `translate` doit être de longueur 2.

source: translate must be between 0 and 1
fr: `translate` doit être pris entre 0 et 1.

source: scale must be length 2
fr: `scale` doit être de longueur 2.

source: scale must be positive
fr: `scale` doit être positive.

source: shear must be positive if it's a single value
fr: `shear` doit être positif quand c'est une valeur unique.

source: shear's length must be 1, 2, or 4
fr: La longueur de `shear` doit être 1, 2 ou 4.

source: not implemented for {class(x)}
fr: n'est pas supporté pour {class(x)}.

source: The cast from {img$dtype} to {dtype} cannot be performed safely.
fr: La conversion de {img$dtype} en {dtype} ne peut pas être faite sans risque.

source: std evaluated to zero after conversion to {dtype}, leading to division by zero.
fr: Après conversion en {dtype}, l'écart-type est à zéro, ce qui conduit à une division par zéro.

source: This interpolation mode is unsupported with Tensor input
fr: Ce mode d'interpolation n'est pas applicable à une entrée de type tenseur.

source: Size must be a numeric vector of length 1 or 2.
fr: `size` doit être un vecteur numérique de longueur 1 ou 2.

source: Padding must be an int or a 1, 2, or 4 element numeric vector
fr: `padding` doit être un entier, ou un vecteur numérique de taille 1, 2 ou 4.

source: Padding mode should be either constant, edge, reflect or symmetric
fr: Le bourrage `padding_mode` doit être pris parmi `constant`, `edge`, `reflect` ou `symmetric`.

source: Padding can not be negative for symmetric padding_mode
fr: le bourrage `padding` ne peut pas être négatif avec le mode `symmetric`.

source: Please provide only 2 dimensions (h, w) for size.
fr: Le vecteur de `size` doit contenir seulement les deux dimensions (h, w).

source: Requested crop size is bigger than input size.
fr: Le détourage demandée avec `crop` est de taille plus grande que l'entrée.

source: brightness factor is negative
fr: `brightness_factor` doit être positif.

source: contrast must be positive
fr: `contrast` doit être positif.

source: hue_factor must be between -0.5 and 0.5.
fr: `hue_factor` doit être pris entre -0.5 et 0.5

source: saturation factor must be positive.
fr: `saturation_factor` doit être positif.

source: `angle` should be int or float
fr: `angle` doit être un entier ou un réel.

source: `translate` should be length 2
fr: `translate` devrait être de longueur 2.

source: `scale` should be positive
fr: `scale` doit être positif.

source: `shear` should be either a single value or a sequence of 2 values
fr: `shear` doit être une valeur simple ou un vecteur de deux valeurs numériques.

source: `transform_perspective` is not implemented yet.
fr: `transform_perspective` n'est pas encore implémenté.

source: tensor is not a torch image.
fr: Le tenseur n'est pas une image torch.

source: Symmetric padding of N-D tensors are not supported yet
fr: Le bourrage en mode `symmetric` de tenseurs de dimension N n'est pas encore implémenté.

source: gamma must be non-negative
fr: `gamma` doit être positif.

source: Pretrained weights on COCO require {.var num_classes} to be {.val 21}.
fr: Les poids pré-entraînés sur COCO nécessitent {.var num_classes} à {.val 21}.

source: Pretrained weights on ADE20K require {.var num_classes} to be {.val 150}.
fr: Les poids pré-entraînés sur ADE20K nécessitent {.var num_classes} à {.val 150}.

source: The provided x class {.class {class(x)}} is not supported
fr: la classe fournie {.cls {class(x)}} n'est pas supportée.

source: Pass an individual image as `x`, not a batch
fr: Il faut passer une image individuelle en `x`, et non un batch.

source: Only grayscale and RGB images are supported
fr: Seules les images en niveau de gris et RGB son prise en compte.

source: `x` should be of dtype `torch_uint8` or `torch_float`
fr: `x` doit être de type `torch_uint8` ou `torch_float`

source: Boxes need to be in c(xmin, ymin, xmax, ymax) format. Use `box_convert()` to convert them
fr: Les boîtes doivent être au format c(xmin, ymin, xmax, ymax). Utilisez `box_convert()` pour les convertir

source: boxes doesn't contain any box. No box was drawn
fr: `boxes` ne contient aucun cadre. Aucun cadre n'a été tracé.

source: Number of labels {.val {length(labels)}} cannot be broadcasted on number of boxes {.val {num_boxes}}
fr: Le nombre d'étiquettes {.val {length(labels)}} n'est pas un multiple et ne peut donc pas être broadcasté sur le nombre de boites {.val {num_boxes}}.

source: colors vector cannot be broadcasted on boxes
fr: le vecteur de couleurs ne peut pas être broadcasté sur les boites (nombres non multiples l'un de l'autre)

source: Mask matrix dimensions (%d x %d) don't match expected (%d x %d)
fr: Les dimensions de la matrice de masque (%d x %d) ne correspondent pas aux dimensions attendues (%d x %d)

source: The provided object of class {.cls {class(x)}} is not supported by draw_segmentation_masks.
fr: L'objet fourni de classe {.cls {class(x)}} n'est pas pris en charge par `draw_segmentation_masks()`.

source: Pass individual `image`, not batches
fr: Il faut passer une image individuelle en `x`, et non un batch.

source: `x` (image) should be of dtype `torch_uint8` or `torch_float`
fr: `x` (image) doit être de type `torch_uint8` ou `torch_float`

source: `masks` must be of shape (H, W) or (num_masks, H, W)
fr: `masks` doit être de forme (H, W) ou (num_masks, H, W)

source: `masks` is expected to be of dtype torch_bool() or torch_float()
fr: `masks` doit être de type `torch_bool()` ou `torch_float()`.

source: `masks` and `image` must have the same height and width
fr: `masks` et `image` doivent avoir la même hauteur et la même largeur

source: masks doesn't contain any mask. No mask was drawn
fr: `masks` ne contient pas de masque. Aucun masque ne sera tracé.

source: colors vector of size {.value {length(colors)}} cannot be broadcasted on {.value {num_masks}} masks
fr: le vecteur de couleurs de taille {.value {length(colors)}} ne peut pas être broadcasté sur les {.value {num_masks}} masques

source: `image` should be a torch_tensor
fr: Le tenseur n'est pas une image torch.

source: `image` should be of dtype `torch_uint8` or `torch_float`
fr: `image` doit être de type `torch_uint8` ou `torch_float`

source: {.var keypoints} must be of shape (num_instances, K, 2), but is current shape is {.value {keypoints$shape}}
fr: {.var keypoints} doit être de taille (num_instances, K, 2), pourtant sa taille actuelle est {.value {keypoints$shape}}
